{
  "gitSyncId": "66b8d2006491da6bd01b4a87_ae9521e9-17b7-4faf-88cf-2d6631529da1",
  "id": "Page1_text",
  "unpublishedCollection": {
    "name": "text",
    "pageId": "Page1",
    "pluginId": "js-plugin",
    "pluginType": "JS",
    "variables": [
      {
        "name": "description",
        "value": "`<p>This starter application provides essential boilerplate code to help you quickly set up new projects. This includes a config object, state object, and a generic controller. This app uses the Tab widget with <em>hidden tabs</em> to toggle between view and edit modes, controlled by the <code>state.currentTab</code> variable.</p>\n<p>This is a great technique for multi-step forms or workflows. However, for larger or more complex sections, consider using separate pages instead.</p>`"
      },
      {
        "name": "help",
        "value": "`<h3>Starter App</h3>\nBuilding apps with Appsmith is both fun and straightforward! This app includes essential boilerplate code to help you start a new project quickly. The code is thoroughly commented to serve as a reference. While you may not need to comment your code as extensively, keep in mind that <a href=\"https://community.appsmith.com/content/blog/lack-comments-bug\">well-placed comments</a> make your apps easier to manage and maintain.\n\nTips:\n<ol>\n    <li>Use the <strong>\"config\"</strong> object to store static configuration data that doesn't change during runtime. This can include variables, select lists, constants, and other global values that you may need to reference multiple times.</li>\n    <li>Use the <strong>\"state\"</strong> object to manage dynamic data that changes frequently. This typically includes global mutable variables. This starter app also provides methods to save and reload the state object, allowing users to continue where they left off after a page reload.</li>\n    <li>The <strong>\"controller\"</strong> is the app's base controller. As your app grows, you'll likely create new objects to handle specific functionalities, ideally organized by domain or feature set (such as an \"app\" object).</li>\n    <li>For your widgets, follow the recommended <a href=\"https://community.appsmith.com/content/blog/recommended-appsmith-naming-conventions\">naming conventions</a>. This will make it easier to manage your app as it becomes more complex.</li>\n    <li>Use state variables for most of your data bindings, especially if the data changes. This approach improves performance and makes your app easier to adjust and manage.</li>\n</ol>\nFollowing these tips will help you build apps that are more performant and maintainable. Keep in mind that you're developing a client-side web application, so many of your performance considerations will involve common challenges present in all browser-based apps.`"
      }
    ]
  }
}